{
  "nodes": [
    {
      "op": "null", 
      "name": "user", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "gmf_user_weight", 
      "attrs": {"__init__": "[\"normal\", {\"sigma\": 0.01}]"}, 
      "inputs": []
    }, 
    {
      "op": "Embedding", 
      "name": "embed_user64", 
      "attrs": {
        "input_dim": "138493", 
        "output_dim": "64"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "item", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "gmf_item_weight", 
      "attrs": {"__init__": "[\"normal\", {\"sigma\": 0.01}]"}, 
      "inputs": []
    }, 
    {
      "op": "Embedding", 
      "name": "embed_item64", 
      "attrs": {
        "input_dim": "26744", 
        "output_dim": "64"
      }, 
      "inputs": [[3, 0, 0], [4, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul0", 
      "inputs": [[2, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fused_mlp_user_weight", 
      "attrs": {"__init__": "[\"normal\", {\"sigma\": 0.01}]"}, 
      "inputs": []
    }, 
    {
      "op": "Embedding", 
      "name": "fused_embed_user128", 
      "attrs": {
        "input_dim": "138493", 
        "output_dim": "256"
      }, 
      "inputs": [[0, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fused_mlp_item_weight", 
      "attrs": {"__init__": "[\"normal\", {\"sigma\": 0.01}]"}, 
      "inputs": []
    }, 
    {
      "op": "Embedding", 
      "name": "fused_embed_item128", 
      "attrs": {
        "input_dim": "26744", 
        "output_dim": "256"
      }, 
      "inputs": [[3, 0, 0], [9, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus0", 
      "inputs": [[8, 0, 0], [10, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "act_0", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[11, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fc_1_weight", 
      "attrs": {"__init__": "[\"golorot_uniform\", {\"fan_in\": 256, \"fan_out\": 128}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc_1_bias", 
      "attrs": {"num_hidden": "128"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fc_1", 
      "attrs": {"num_hidden": "128"}, 
      "inputs": [[12, 0, 0], [13, 0, 0], [14, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "act_1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[15, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fc_2_weight", 
      "attrs": {"__init__": "[\"golorot_uniform\", {\"fan_in\": 128, \"fan_out\": 64}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc_2_bias", 
      "attrs": {"num_hidden": "64"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fc_2", 
      "attrs": {"num_hidden": "64"}, 
      "inputs": [[16, 0, 0], [17, 0, 0], [18, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "act_2", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[19, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "post_gemm_concat", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[6, 0, 0], [20, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fc_final_weight", 
      "attrs": {"__init__": "[\"lecunn_uniform\", {\"fan_in\": 128}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc_final_bias", 
      "attrs": {"num_hidden": "1"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fc_final", 
      "attrs": {"num_hidden": "1"}, 
      "inputs": [[21, 0, 0], [22, 0, 0], [23, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "softmax_label", 
      "inputs": []
    }, 
    {
      "op": "LogisticRegressionOutput", 
      "name": "sigmoid_final", 
      "inputs": [[24, 0, 0], [25, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    1, 
    3, 
    4, 
    7, 
    9, 
    13, 
    14, 
    17, 
    18, 
    22, 
    23, 
    25
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27
  ], 
  "heads": [[26, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 10600]}
}