{
  "nodes": [
    {
      "op": "null", 
      "name": "user", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "gmf_user_weight_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "gmf_user_weight_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "gmf_user_weight_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "_contrib_quantized_embedding", 
      "name": "quantized_embed_user64", 
      "attrs": {
        "input_dim": "138493", 
        "output_dim": "64"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "item", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "gmf_item_weight_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "gmf_item_weight_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "gmf_item_weight_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "_contrib_quantized_embedding", 
      "name": "quantized_embed_item64", 
      "attrs": {
        "input_dim": "26744", 
        "output_dim": "64"
      }, 
      "inputs": [[5, 0, 0], [6, 0, 0], [7, 0, 0], [8, 0, 0]]
    }, 
    {
      "op": "_contrib_quantized_elemwise_mul", 
      "name": "quantized__mul0", 
      "attrs": {
        "max_calib_range": "4.937704", 
        "min_calib_range": "-3.313296"
      }, 
      "inputs": [[4, 0, 0], [9, 0, 0], [4, 1, 0], [4, 2, 0], [9, 1, 0], [9, 2, 0]]
    }, 
    {
      "op": "null", 
      "name": "mlp_user_weight_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mlp_user_weight_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mlp_user_weight_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "_contrib_quantized_embedding", 
      "name": "quantized_embed_user128", 
      "attrs": {
        "input_dim": "138493", 
        "output_dim": "128"
      }, 
      "inputs": [[0, 0, 0], [11, 0, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "mlp_item_weight_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mlp_item_weight_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mlp_item_weight_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "_contrib_quantized_embedding", 
      "name": "quantized_embed_item128", 
      "attrs": {
        "input_dim": "26744", 
        "output_dim": "128"
      }, 
      "inputs": [[5, 0, 0], [15, 0, 0], [16, 0, 0], [17, 0, 0]]
    }, 
    {
      "op": "_contrib_quantized_concat", 
      "name": "quantized_pre_gemm_concat", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[14, 0, 0], [18, 0, 0], [14, 1, 0], [14, 2, 0], [18, 1, 0], [18, 2, 0]]
    }, 
    {
      "op": "null", 
      "name": "fc_0_weight_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc_0_bias_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc_0_weight_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc_0_weight_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc_0_bias_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc_0_bias_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "_sg_mkldnn_fully_connected", 
      "name": "quantized_sg_mkldnn_fully_connected_eltwise_0", 
      "attrs": {
        "max_calib_range": "28.537586", 
        "min_calib_range": "0.000000", 
        "quantized": "True", 
        "with_eltwise": "True"
      }, 
      "inputs": [[19, 0, 0], [20, 0, 0], [21, 0, 0], [19, 1, 0], [19, 2, 0], [22, 0, 0], [23, 0, 0], [24, 0, 0], [25, 0, 0]], 
      "subgraphs": [
        {
          "nodes": [
            {
              "op": "null", 
              "name": "pre_gemm_concat_output0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "fc_0_weight0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "fc_0_bias0", 
              "inputs": []
            }, 
            {
              "op": "FullyConnected", 
              "name": "fc_0", 
              "attrs": {"num_hidden": "256"}, 
              "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
            }, 
            {
              "op": "Activation", 
              "name": "act_0", 
              "attrs": {"act_type": "relu"}, 
              "inputs": [[3, 0, 0]]
            }
          ], 
          "arg_nodes": [0, 1, 2], 
          "node_row_ptr": [0, 1, 2, 3, 4, 5], 
          "heads": [[4, 0, 0]]
        }
      ]
    }, 
    {
      "op": "null", 
      "name": "fc_1_weight_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc_1_bias_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc_1_weight_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc_1_weight_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc_1_bias_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc_1_bias_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "_sg_mkldnn_fully_connected", 
      "name": "quantized_sg_mkldnn_fully_connected_eltwise_1", 
      "attrs": {
        "max_calib_range": "58.899498", 
        "min_calib_range": "0.000000", 
        "quantized": "True", 
        "with_eltwise": "True"
      }, 
      "inputs": [[26, 0, 0], [27, 0, 0], [28, 0, 0], [26, 1, 0], [26, 2, 0], [29, 0, 0], [30, 0, 0], [31, 0, 0], [32, 0, 0]], 
      "subgraphs": [
        {
          "nodes": [
            {
              "op": "null", 
              "name": "sg_mkldnn_fully_connected_eltwise_0_output0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "fc_1_weight0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "fc_1_bias0", 
              "inputs": []
            }, 
            {
              "op": "FullyConnected", 
              "name": "fc_1", 
              "attrs": {"num_hidden": "128"}, 
              "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
            }, 
            {
              "op": "Activation", 
              "name": "act_1", 
              "attrs": {"act_type": "relu"}, 
              "inputs": [[3, 0, 0]]
            }
          ], 
          "arg_nodes": [0, 1, 2], 
          "node_row_ptr": [0, 1, 2, 3, 4, 5], 
          "heads": [[4, 0, 0]]
        }
      ]
    }, 
    {
      "op": "null", 
      "name": "fc_2_weight_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc_2_bias_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc_2_weight_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc_2_weight_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc_2_bias_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc_2_bias_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "_sg_mkldnn_fully_connected", 
      "name": "quantized_sg_mkldnn_fully_connected_eltwise_2", 
      "attrs": {
        "enable_float_output": "True", 
        "quantized": "True", 
        "with_eltwise": "True"
      }, 
      "inputs": [[33, 0, 0], [34, 0, 0], [35, 0, 0], [33, 1, 0], [33, 2, 0], [36, 0, 0], [37, 0, 0], [38, 0, 0], [39, 0, 0]], 
      "subgraphs": [
        {
          "nodes": [
            {
              "op": "null", 
              "name": "sg_mkldnn_fully_connected_eltwise_1_output0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "fc_2_weight0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "fc_2_bias0", 
              "inputs": []
            }, 
            {
              "op": "FullyConnected", 
              "name": "fc_2", 
              "attrs": {"num_hidden": "64"}, 
              "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
            }, 
            {
              "op": "Activation", 
              "name": "act_2", 
              "attrs": {"act_type": "relu"}, 
              "inputs": [[3, 0, 0]]
            }
          ], 
          "arg_nodes": [0, 1, 2], 
          "node_row_ptr": [0, 1, 2, 3, 4, 5], 
          "heads": [[4, 0, 0]]
        }
      ]
    }, 
    {
      "op": "Concat", 
      "name": "post_gemm_concat", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[10, 0, 0], [40, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fc_final_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"lecunn_uniform\", {\"fan_in\": 128}]"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc_final_bias", 
      "attrs": {
        "__dtype__": "0", 
        "num_hidden": "1"
      }, 
      "inputs": []
    }, 
    {
      "op": "_sg_mkldnn_fully_connected", 
      "name": "sg_mkldnn_fully_connected_3", 
      "inputs": [[41, 0, 0], [42, 0, 0], [43, 0, 0]], 
      "subgraphs": [
        {
          "nodes": [
            {
              "op": "null", 
              "name": "post_gemm_concat_output0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "fc_final_weight0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "fc_final_bias0", 
              "inputs": []
            }, 
            {
              "op": "FullyConnected", 
              "name": "fc_final", 
              "attrs": {"num_hidden": "1"}, 
              "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
            }
          ], 
          "arg_nodes": [0, 1, 2], 
          "node_row_ptr": [0, 1, 2, 3, 4], 
          "heads": [[3, 0, 0]]
        }
      ]
    }, 
    {
      "op": "null", 
      "name": "softmax_label", 
      "inputs": []
    }, 
    {
      "op": "LogisticRegressionOutput", 
      "name": "sigmoid_final", 
      "inputs": [[44, 0, 0], [45, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    1, 
    2, 
    3, 
    5, 
    6, 
    7, 
    8, 
    11, 
    12, 
    13, 
    15, 
    16, 
    17, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    27, 
    28, 
    29, 
    30, 
    31, 
    32, 
    34, 
    35, 
    36, 
    37, 
    38, 
    39, 
    42, 
    43, 
    45
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    7, 
    8, 
    9, 
    10, 
    11, 
    14, 
    17, 
    18, 
    19, 
    20, 
    23, 
    24, 
    25, 
    26, 
    29, 
    32, 
    33, 
    34, 
    35, 
    36, 
    37, 
    38, 
    41, 
    42, 
    43, 
    44, 
    45, 
    46, 
    47, 
    50, 
    51, 
    52, 
    53, 
    54, 
    55, 
    56, 
    57, 
    58, 
    59, 
    60, 
    61, 
    62, 
    63
  ], 
  "heads": [[46, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 10600]}
}