{
  "nodes": [
    {
      "op": "null", 
      "name": "data0", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "embedding0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"normal\", {\"sigma\": 0.01}]", 
        "__lr_mult__": "1.0", 
        "__shape__": "(138493, 64)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Embedding", 
      "name": "embedding0_fwd", 
      "attrs": {
        "dtype": "float32", 
        "input_dim": "138493", 
        "output_dim": "64", 
        "sparse_grad": "False"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "data1", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "embedding1_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"normal\", {\"sigma\": 0.01}]", 
        "__lr_mult__": "1.0", 
        "__shape__": "(26744, 64)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Embedding", 
      "name": "embedding1_fwd", 
      "attrs": {
        "dtype": "float32", 
        "input_dim": "26744", 
        "output_dim": "64", 
        "sparse_grad": "False"
      }, 
      "inputs": [[3, 0, 0], [4, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "neumf0__mul0", 
      "inputs": [[2, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "embedding2_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"normal\", {\"sigma\": 0.01}]", 
        "__lr_mult__": "1.0", 
        "__shape__": "(138493, 128)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Embedding", 
      "name": "embedding2_fwd", 
      "attrs": {
        "dtype": "float32", 
        "input_dim": "138493", 
        "output_dim": "128", 
        "sparse_grad": "False"
      }, 
      "inputs": [[0, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "embedding3_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"normal\", {\"sigma\": 0.01}]", 
        "__lr_mult__": "1.0", 
        "__shape__": "(26744, 128)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Embedding", 
      "name": "embedding3_fwd", 
      "attrs": {
        "dtype": "float32", 
        "input_dim": "26744", 
        "output_dim": "128", 
        "sparse_grad": "False"
      }, 
      "inputs": [[3, 0, 0], [9, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "neumf0_concat0", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[8, 0, 0], [10, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "dense0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"golorot_uniform\", {\"fan_in\": 128, \"fan_out\": 256}]", 
        "__lr_mult__": "1.0", 
        "__shape__": "(256, 0)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "dense0_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(256,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "dense0_fwd", 
      "attrs": {
        "flatten": "True", 
        "no_bias": "False", 
        "num_hidden": "256"
      }, 
      "inputs": [[11, 0, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "dense0_relu_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[14, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "dense1_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"golorot_uniform\", {\"fan_in\": 256, \"fan_out\": 128}]", 
        "__lr_mult__": "1.0", 
        "__shape__": "(128, 0)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "dense1_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(128,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "dense1_fwd", 
      "attrs": {
        "flatten": "True", 
        "no_bias": "False", 
        "num_hidden": "128"
      }, 
      "inputs": [[15, 0, 0], [16, 0, 0], [17, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "dense1_relu_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[18, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "dense2_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"golorot_uniform\", {\"fan_in\": 128, \"fan_out\": 64}]", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64, 0)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "dense2_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "dense2_fwd", 
      "attrs": {
        "flatten": "True", 
        "no_bias": "False", 
        "num_hidden": "64"
      }, 
      "inputs": [[19, 0, 0], [20, 0, 0], [21, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "dense2_relu_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[22, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "neumf0_concat1", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[6, 0, 0], [23, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "dense3_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"lecunn_uniform\", {\"fan_in\": 128}]", 
        "__lr_mult__": "1.0", 
        "__shape__": "(1, 0)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "dense3_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(1,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "dense3_fwd", 
      "attrs": {
        "flatten": "True", 
        "no_bias": "False", 
        "num_hidden": "1"
      }, 
      "inputs": [[24, 0, 0], [25, 0, 0], [26, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    1, 
    3, 
    4, 
    7, 
    9, 
    12, 
    13, 
    16, 
    17, 
    20, 
    21, 
    25, 
    26
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28
  ], 
  "heads": [[27, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 10501]}
}